README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#org9a28923)
2.  [Resumo e/ou informação extra:](#org1305875)
3.  [Versão:](#org7d4175e)
4.  [Data:](#orgfae4ece)
5.  [Autor de Contato:](#orgab1a860)
6.  [Lista dos Autores:](#org8fdf278)
7.  [Áreas de pesquisa vinculadas:](#org0cdf77b)
8.  [Vinculo com:](#org2f5bd65)
9.  [Paradigmas:](#orgbf3911a)
10. [Tipo de Interface:](#org4d07546)
11. [Plataformas Suportadas:](#orgdec94fd)
12. [Linguagens Utilizadas:](#org2e6b7f4)
13. [Bibliotecas Utilizadas (dependências):](#orgba047c4)
14. [Softwares utilizados (dependências)](#org3da2f71)
15. [Tipo de Licença:](#org6b101a6)
16. [Vinculo com:](#orgdeb2c2c)
17. [Links:](#org3efff9b)
18. [Todo](#org482d761)
    1.  [A primeira atividade a ser desenvolvida é converter a estrutura de diretórios para o novo formato.](#orgbbbe72c)


<a id="org9a28923"></a>

# Nome do Software (ou Biblioteca):

-   ANÁLISE DO EFEITO DE PELÍCULA A PARTIR DE CURVAS DE ÍNDICE DE PRODUTIVIDADE (IPR) PARA POÇOS VERTICAIS EM ESCOAMENTO MONOFÁSICO DE ÓLEO


<a id="org1305875"></a>

# Resumo e/ou informação extra:

-   Utilizar equações propostas na literatura e em artigos cientı́ficos para o cálculo

do efeito de pelı́cula total.
– Plotar curvas de IPR para poços verticais em escoamento monofásico de óleo a
partir de soluções analı́ticas da E.D.H. considerando regime transiente, pseu-
dopermanente e permanente a partir do software externo Gnuplot.


<a id="org7d4175e"></a>

# Versão:

-   1.0.


<a id="orgfae4ece"></a>

# Data:

-   2013/2 - segundo semestre.


<a id="orgab1a860"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org8fdf278"></a>

# Lista dos Autores:

-   MATHEUS CARVALHO DUARTE
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org0cdf77b"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Engenharia de Reservatório
-   IPR (Inflow Performance Relationship)


<a id="org2f5bd65"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="orgbf3911a"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="org4d07546"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="orgdec94fd"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="org2e6b7f4"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="orgba047c4"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="org3da2f71"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="org6b101a6"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="orgdeb2c2c"></a>

# Vinculo com:

-   A versão 1, desenvolvida pelo Matheus utiliza metodologia antiga, as próximas versões devem usar a metodologia descrita [aqui](https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas).
-   [Trabalho da disciplina Projeto de Software Aplicado à Engenharia](https://sites.google.com/view/professorandreduartebueno/ensino/projeto-de-software-aplicado).
-   Uma lista de outros projetos desenvolvidos no LDSC é disponibilizado [aqui](https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas).


<a id="org3efff9b"></a>

# Links:

-   [Site do Professor André Duarte Bueno](https://sites.google.com/view/professorandreduartebueno/).
-   [Site do LDSC no github](https://github.com/ldsc).
-   [Site do LENEP](https://uenf.br/cct/lenep).


<a id="org482d761"></a>

# Todo


<a id="orgbbbe72c"></a>

## A primeira atividade a ser desenvolvida é converter a estrutura de diretórios para o novo formato.

